# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"

# Install ZSH
brew "zsh"
brew "zsh-completions"

# Improve BASH as Backup
brew "bash"                 # Latest Bash Version (macOS Version is always outdated)
brew "bash-completion"

# System Improvements
brew "bat"
brew "coreutils"
brew "fd"
brew "findutils"
brew "fx"
brew "git"
brew "gnupg"
brew "gnupg2"
brew "grep"
brew "jsonpp"
brew "librsvg"
brew "mackup"
brew "mas"
brew "node"
brew "openssl"
brew "python3"
brew "wget"

# Fun
brew "cowsay"
brew "fortune"
brew "thefuck"

# Photography Tools
brew "exiftool"

# Audio Tools
brew "id3lib"

# Apps
cask "1password"
cask "aerial"
cask "alfred"
cask "algodoo"
cask "appcleaner"
cask "bartender"
cask "brave-browser"
cask "controlplane"
cask "dropbox"
cask "franz"
cask "gimp"
cask "gitkraken"
cask "iina"
cask "java"
cask "malwarebytes"
cask "mounty"
cask "odio"
cask "onedrive"
cask "semulov"
cask "sublime-text"
cask "teamviewer"
cask "vmware-fusion"

# Quicklook Plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"

# Fonts
cask "font-fira-code"

# Install Mac App Store
mas "Airmail 3", id: 918858936
mas "Evernote", id: 406056744
mas "Fantastical 2", id: 975937182
mas "Focus", id: 777233759
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop 10", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Netmo", id: 1192219511
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "PDF Expert", id: 1055273043
mas "Pixelmator Pro", id: 1289583905
mas "The Unarchiver", id: 425424353
mas "Typeface", id: 1062679359
mas "Xcode", id: 497799835