# Taps
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "nonchalant/appicon"

# Install ZSH
brew "zsh"
brew "zsh-completions"

# Improve BASH as Backup
brew "bash"                 # Latest Bash Version (macOS Version is always outdated)
brew "bash-completion"

# System Improvements
brew "coreutils"
brew "findutils"
brew "git"
brew "gpg"
brew "grep"
brew "mackup"
brew "mas"
brew "node"
brew "openssl"
brew "python3"
brew "wget"

# Fun
brew "cowsay"
brew "fortune"
brew "thefuck"

# App Development Tools
brew "appicon"              # = "nonchalant/appicon/appicon"
brew "carthage"
brew "marathon-swift"
brew "swiftlint"

# Photography Tools
brew "exiftool"

# Audio Tools
brew "id3lib"

# Apps
cask "1password"
cask "adobe-creative-cloud"
cask "aerial"
cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "bartender"
cask "charles"
cask "controlplane"
cask "dropbox"
cask "evernote"
cask "fantastical"
cask "forklift"
cask "franz"
cask "gimp"
cask "google-chrome"
cask "iina"
cask "istat-menus"
cask "java"
cask "jdownloader"
cask "kaleidoscope"
cask "little-snitch"
cask "mediathekview"
cask "microsoft-office"
cask "oversight"
cask "paw"
cask "pdf-expert"
cask "sublime-text"
cask "teamviewer"
cask "the-unarchiver"
cask "tower"

# Saved for the future
# cask "sequel-pro"         # MySQL Management 
# cask "vlc"                # Replaced by IINA

# Quicklook Plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklook-csv"

# Fonts
cask "font-fira-code"

# Install Mac App Store apps
mas "Airmail 3", id: 918858936
mas "Bear", id: 1091189122
mas "Ethernet Status", id: 1186187538
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766 
mas "Microsoft Remote Desktop", id: 715768417 
mas "Netmo", id: 1192219511
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Typeface", id: 1062679359
