# Taps
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "nonchalant/appicon"
tap "vapor/tap"

# Install ZSH
brew "zsh"
brew "zsh-completions"

# Improve BASH as Backup
brew "bash"                 # Latest Bash Version (macOS Version is always outdated)
brew "bash-completion"

# System Improvements
brew "bat"
brew "coreutils"
brew "fd"
brew "findutils"
brew "fx"
brew "git"
brew "gnupg"
brew "gnupg2"
brew "grep"
brew "hub"
brew "jenv"
brew "jsonpp"
brew "mackup"
brew "mas"
brew "node"
brew "openssl"
brew "python3"
brew "wget"

# Fun
brew "cowsay"
brew "fortune"
brew "thefuck"

# App Development Tools
brew "appicon"              # = "nonchalant/appicon/appicon"
brew "carthage"
brew "graphviz"             # Requirement for parsing PlantUML in Sublime Text
brew "marathon-swift"
brew "swiftlint"

# Vapor Tools
brew "vapor"                # = "vapor/tap/vapor"

# Photography Tools
brew "exiftool"

# Audio Tools
brew "id3lib"

# Apps
cask "1password"
cask "adobe-creative-cloud" # needs manual installation from dmg file
cask "aerial"
cask "alfred"
cask "android-studio"
cask "appcleaner"
cask "bartender"
cask "charles"
cask "contraste"
cask "controlplane"
cask "docker"
cask "dropbox"
cask "duet"
cask "forklift"
cask "franz"
cask "gimp"
cask "google-chrome"
cask "icons8"
cask "iina"
cask "istat-menus"
cask "java8"
cask "jdownloader"
cask "kaleidoscope"
cask "little-snitch"        # needs manual installation from dmg file
cask "mediathekview"
cask "mounty"
cask "paw"
cask "runjs"
cask "semulov"
cask "sublime-text"
cask "teamviewer"
cask "torbrowser"
cask "tower2"
cask "vlc"

# Quicklook Plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklook-csv"

# Fonts
cask "font-fira-code"

# Install Mac App Store 
mas "Apple Configurator 2", id: 1037126344
mas "Bear", id: 1091189122
mas "Ethernet Status", id: 1186187538
mas "Evernote", id: 406056744
mas "Fantastical 2", id: 975937182
mas "FileBot", id: 905384638
mas "Keynote", id: 409183694
mas "Liya", id: 455484422
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop 10", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "NepTunes", id: 1006739057
mas "Netmo", id: 1192219511
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "PDF Expert", id: 1055273043
mas "Pixelmator Pro", id: 1289583905
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Typeface", id: 1062679359
mas "Xcode", id: 497799835
